In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [10]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [11]:
names = ['a', 'b', 'c', 'd', 'message']

In [13]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [14]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

In [15]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [25]:
result = pd.read_table('ex3.txt', sep="\s+")

In [26]:
result

     ['         A         B          C\n',
0  'aaa -0.264438 -1.026059  -0.061500\n',
1  'bbb  0.972456  0.302123  -0.025874\n',
2  'ccc -0.264589 -0.386123  -0.214569\n',
3  'ddd -0.125896 -0.358963   1.123333\n']

In [27]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
pd.read_csv('ex4.csv') # Without skipping rows.

                                                                        # hey
a                                                  b         c   d    message
# just wanted to make things more difficult for... NaN       NaN NaN      NaN
# who reads CSV files with  commputers              anyway ? NaN NaN      NaN
1                                                  2         3   4      hello
5                                                  6         7   8      world
9                                                  10        11  12       foo

In [31]:
result = pd.read_csv('ex5.csv')

In [32]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [33]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [38]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [39]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']} # putting own NULL values.

In [43]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading Text Files in Pieces

In [44]:
pd.options.display.max_rows = 10

In [45]:
result = pd.read_csv('ex6.csv')

In [46]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [47]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [74]:
# reading files via chunk size.
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [75]:
chunker

In [77]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

tot = pd.Series([], dtype=object)
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
        
tot = tot.sort_values(ascending=False)

In [78]:
tot[:10]

E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
dtype: object

## Writing Data to Text Format

In [2]:
data = pd.read_csv('ex5.csv')

In [3]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [5]:
data.to_csv('out.csv') # it will create a new file named 'out.csv' which contains 'data'.

In [6]:
import sys

In [31]:
data.to_csv(sys.stdout, sep='|') # it will prints data to our console. Missing values appeasrs as empty string.

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [34]:
data.to_csv(sys.stdout, sep="|", na_rep='Null') # Not available values set as Null by us.

|something|a|b|c|d|message
0|one|1|2|3.0|4|Null
1|two|5|6|Null|8|world
2|three|9|10|11.0|12|foo

In [15]:
data.to_csv(sys.stdout, index=False, header=False) # it will print data to console without including indexes and headers.

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [17]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c']) # We can print only columns.

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [18]:
# Series also have to_csv method.
dates = pd.date_range('1/1/2000', periods=7)

In [23]:
ts = pd.Series(np.arange(7), index=dates)

In [24]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [25]:
ts.to_csv('tseries.csv')

## Working with Delimited Formats

In [57]:
import csv
f = open('ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

# We can pritnt delimited files with python's csv module.

['a', ' "b"', ' "c"']
['1', ' "2"', ' "3"']
['1', ' "2"', ' "3"']

In [82]:
# Now it'sup on us that how we wrangling the data.
# Lets take step by step example.

with open('ex7.csv') as f:
    lines = list(csv.reader(f))

    # Then we split the line into the header line and data line.
    header, values = lines[0], lines[1:]

    # Then we create a dictionary of data columns using a dictionary comprehension and the expression zip(*values).
    # Which transpose rows to column.
    data_dict = {h: v for h, v in zip(header, zip(*values))}
    data_dict

    # CSV file comes in many different flavors. To define a new format with a different delimiter, sring quoting convention.

    class my_dialect(csv.Dialect):
        lineterminator = '\n'
        delimiter = ';'
        quotechar = '"'
        quoting = csv.QUOTE_MINIMAL

    reader = csv.reader(f, dialect=my_dialect)
    reader = csv.reader(f, delimiter='|')

In [84]:
#with writer we can writerows into the mydata.csv

with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

## JSON Data

In [128]:
obj = """
    {
    "name": "bhavik",
    "places": ["surat"],
    "pets":["dog", "cat", "dragon", "lion", "mouse", "oonder"],
    "siblings": [{"name": "Mitesh", "age": "25", "pets":"Tempo"}]
    }
"""

In [129]:
import json

In [130]:
result = json.loads(obj) # loads obj into a result.

In [131]:
asjson = json.dumps(result) # dumping result into asjson. Now we are able to execute python operations on asjson.

In [132]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [133]:
siblings

     name age
0  Mitesh  25

In [134]:
pets = pd.DataFrame(result['pets'], columns=['pets'])

In [135]:
pets

     pets
0     dog
1     cat
2  dragon
3    lion
4   mouse
5  oonder

In [136]:
# reading json file.

In [138]:
data = pd.read_json('example.json')

In [139]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  6  7  9

In [140]:
#Exporting data from pandas to json.
print(data.to_json())

{"a":{"0":1,"1":4,"2":6},"b":{"0":2,"1":5,"2":7},"c":{"0":3,"1":6,"2":9}}

In [141]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":6,"b":7,"c":9}]

## XML and HTML : Web Scraping

In [3]:
tables = pd.read_html('fdic_failed_bank_list.html')

In [4]:
len(tables)

1

In [11]:
failures = tables[0]

In [27]:
import csv
failures.to_csv('html_save.csv') # I am just saving this file as csv to my computer for future records.

In [24]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [25]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64